# PointAdaptiveShowNumber Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PointAdaptiveShowNumber Property
ParameterTypeId Class See Also
---
"Show Placement Number"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PointAdaptiveShowNumber { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PointAdaptiveShowNumber As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PointAdaptiveShowNumber {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace